benches/perf-test/results-latest.txt
---------------------------------------------
- wrk -t12 -c100 -d30s http://localhost:8080 -
Running 30s test @ http://localhost:8080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   360.68us  199.09us   3.59ms   77.35%
    Req/Sec    21.84k     1.22k   42.91k    81.05%
  7835040 requests in 30.10s, 478.21MB read
Requests/sec: 260306.80
Transfer/sec:     15.89MB
---------------------------------------------
- wrk -t12 -c300 -d30s http://localhost:8080 -
Running 30s test @ http://localhost:8080
  12 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.90ms  576.23us  15.26ms   78.88%
    Req/Sec    27.13k     2.02k   34.08k    67.83%
  9724119 requests in 30.03s, 593.51MB read
Requests/sec: 323780.76
Transfer/sec:     19.76MB
---------------------------------------------
- wrk -t12 -c900 -d30s http://localhost:8080 -
Running 30s test @ http://localhost:8080
  12 threads and 900 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.74ms    2.25ms 209.79ms   83.71%
    Req/Sec    25.73k     3.07k   58.17k    72.74%
  9229858 requests in 30.11s, 563.35MB read
Requests/sec: 306582.99
Transfer/sec:     18.71MB
---------------------------------------------