benches/perf-test/results-latest.txt
---------------------------------------------
- wrk -t12 -c100 -d30s http://localhost:8080 -
Running 30s test @ http://localhost:8080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   303.09us  209.82us  21.49ms   85.28%
    Req/Sec    26.61k     2.79k   75.16k    83.43%
  9539714 requests in 30.10s, 564.06MB read
Requests/sec: 316932.54
Transfer/sec:     18.74MB
---------------------------------------------
- wrk -t12 -c300 -d30s http://localhost:8080 -
Running 30s test @ http://localhost:8080
  12 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   726.75us  577.25us  37.42ms   88.29%
    Req/Sec    35.13k     4.00k   63.44k    73.61%
  12592157 requests in 30.06s, 744.55MB read
Requests/sec: 418921.66
Transfer/sec:     24.77MB
---------------------------------------------
- wrk -t12 -c900 -d30s http://localhost:8080 -
Running 30s test @ http://localhost:8080
  12 threads and 900 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.39ms    4.34ms 214.61ms   97.37%
    Req/Sec    32.69k     5.51k   56.70k    69.58%
  11724177 requests in 30.09s, 693.22MB read
Requests/sec: 389575.92
Transfer/sec:     23.03MB
---------------------------------------------